In [0]:
%matplotlib inline

import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [784]:
url='https://raw.githubusercontent.com/rylp/data_sets/master/loan_pred_data/train_ctrUa4K.csv'
df_train=pd.read_csv(url)
df_train.head(10)

    Loan_ID Gender Married  ... Credit_History Property_Area Loan_Status
0  LP001002   Male      No  ...            1.0         Urban           Y
1  LP001003   Male     Yes  ...            1.0         Rural           N
2  LP001005   Male     Yes  ...            1.0         Urban           Y
3  LP001006   Male     Yes  ...            1.0         Urban           Y
4  LP001008   Male      No  ...            1.0         Urban           Y
5  LP001011   Male     Yes  ...            1.0         Urban           Y
6  LP001013   Male     Yes  ...            1.0         Urban           Y
7  LP001014   Male     Yes  ...            0.0     Semiurban           N
8  LP001018   Male     Yes  ...            1.0         Urban           Y
9  LP001020   Male     Yes  ...            1.0     Semiurban           N

[10 rows x 13 columns]

In [785]:
url='https://raw.githubusercontent.com/rylp/data_sets/master/loan_pred_data/test_lAUu6dG.csv'
df_test=pd.read_csv(url)
df_test.head(10)

    Loan_ID  Gender Married  ... Loan_Amount_Term Credit_History Property_Area
0  LP001015    Male     Yes  ...            360.0            1.0         Urban
1  LP001022    Male     Yes  ...            360.0            1.0         Urban
2  LP001031    Male     Yes  ...            360.0            1.0         Urban
3  LP001035    Male     Yes  ...            360.0            NaN         Urban
4  LP001051    Male      No  ...            360.0            1.0         Urban
5  LP001054    Male     Yes  ...            360.0            1.0         Urban
6  LP001055  Female      No  ...            360.0            1.0     Semiurban
7  LP001056    Male     Yes  ...            360.0            0.0         Rural
8  LP001059    Male     Yes  ...            240.0            1.0         Urban
9  LP001067    Male      No  ...            360.0            1.0     Semiurban

[10 rows x 12 columns]

In [786]:
loan_id = df_test.iloc[:,0]
loan_id

0      LP001015
1      LP001022
2      LP001031
3      LP001035
4      LP001051
         ...
362    LP002971
363    LP002975
364    LP002980
365    LP002986
366    LP002989
Name: Loan_ID, Length: 367, dtype: object

In [787]:
df_train.isnull().sum().sort_values(ascending=False)

Credit_History       50
Self_Employed        32
LoanAmount           22
Dependents           15
Loan_Amount_Term     14
Gender               13
Married               3
Loan_Status           0
Property_Area         0
CoapplicantIncome     0
ApplicantIncome       0
Education             0
Loan_ID               0
dtype: int64

In [788]:
df_test.isnull().sum().sort_values(ascending=False)

Credit_History       29
Self_Employed        23
Gender               11
Dependents           10
Loan_Amount_Term      6
LoanAmount            5
Property_Area         0
CoapplicantIncome     0
ApplicantIncome       0
Education             0
Married               0
Loan_ID               0
dtype: int64

In [0]:
df_train.drop(columns=['Loan_ID','Credit_History','Self_Employed'], axis=1, inplace=True)

In [790]:
df_train

     Gender Married Dependents  ... Loan_Amount_Term  Property_Area  Loan_Status
0      Male      No          0  ...            360.0          Urban            Y
1      Male     Yes          1  ...            360.0          Rural            N
2      Male     Yes          0  ...            360.0          Urban            Y
3      Male     Yes          0  ...            360.0          Urban            Y
4      Male      No          0  ...            360.0          Urban            Y
..      ...     ...        ...  ...              ...            ...          ...
609  Female      No          0  ...            360.0          Rural            Y
610    Male     Yes         3+  ...            180.0          Rural            Y
611    Male     Yes          1  ...            360.0          Urban            Y
612    Male     Yes          2  ...            360.0          Urban            Y
613  Female      No          0  ...            360.0      Semiurban            N

[614 rows x 10 columns]

In [0]:
df_test.drop(columns=['Loan_ID','Credit_History','Self_Employed'], axis=1, inplace=True)

In [792]:
df_test

    Gender Married Dependents  ... LoanAmount  Loan_Amount_Term  Property_Area
0     Male     Yes          0  ...      110.0             360.0          Urban
1     Male     Yes          1  ...      126.0             360.0          Urban
2     Male     Yes          2  ...      208.0             360.0          Urban
3     Male     Yes          2  ...      100.0             360.0          Urban
4     Male      No          0  ...       78.0             360.0          Urban
..     ...     ...        ...  ...        ...               ...            ...
362   Male     Yes         3+  ...      113.0             360.0          Urban
363   Male     Yes          0  ...      115.0             360.0          Urban
364   Male      No          0  ...      126.0             360.0      Semiurban
365   Male     Yes          0  ...      158.0             360.0          Rural
366   Male      No          0  ...       98.0             180.0          Rural

[367 rows x 9 columns]

In [793]:
mean_amt= df_train['LoanAmount'].dropna().mean()
mean_amt

146.41216216216216

In [0]:
df_train['LoanAmount'].fillna(mean_amt, inplace=True)

In [795]:
df_train.isnull().sum()

Gender               13
Married               3
Dependents           15
Education             0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term     14
Property_Area         0
Loan_Status           0
dtype: int64

In [796]:
mean_loan_term= df_train['Loan_Amount_Term'].dropna().mean()
mean_loan_term

342.0

In [0]:
df_train['Loan_Amount_Term'].fillna(mean_amt, inplace=True)

In [798]:
df_train.isnull().sum()

Gender               13
Married               3
Dependents           15
Education             0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term      0
Property_Area         0
Loan_Status           0
dtype: int64

In [0]:
df_train.drop(columns=['Gender','Married','Dependents','Education','Property_Area','Loan_Amount_Term','CoapplicantIncome'],axis=1,inplace=True)

In [800]:
df_train

     ApplicantIncome  LoanAmount Loan_Status
0               5849  146.412162           Y
1               4583  128.000000           N
2               3000   66.000000           Y
3               2583  120.000000           Y
4               6000  141.000000           Y
..               ...         ...         ...
609             2900   71.000000           Y
610             4106   40.000000           Y
611             8072  253.000000           Y
612             7583  187.000000           Y
613             4583  133.000000           N

[614 rows x 3 columns]

In [0]:
df_test.drop(columns=['Gender','Married','Dependents','Education','Property_Area','Loan_Amount_Term','CoapplicantIncome'],axis=1,inplace=True)

In [802]:
df_test

     ApplicantIncome  LoanAmount
0               5720       110.0
1               3076       126.0
2               5000       208.0
3               2340       100.0
4               3276        78.0
..               ...         ...
362             4009       113.0
363             4158       115.0
364             3250       126.0
365             5000       158.0
366             9200        98.0

[367 rows x 2 columns]

In [803]:
df_train.isnull().sum()

ApplicantIncome    0
LoanAmount         0
Loan_Status        0
dtype: int64

In [804]:
df_test.isnull().sum()

ApplicantIncome    0
LoanAmount         5
dtype: int64

In [805]:
mean_amt_test= df_test['LoanAmount'].dropna().mean()
mean_amt_test

136.13259668508286

In [0]:
df_test['LoanAmount'].fillna(mean_amt_test, inplace=True)

In [807]:
df_test.isnull().sum()

ApplicantIncome    0
LoanAmount         0
dtype: int64

In [808]:
df_train

     ApplicantIncome  LoanAmount Loan_Status
0               5849  146.412162           Y
1               4583  128.000000           N
2               3000   66.000000           Y
3               2583  120.000000           Y
4               6000  141.000000           Y
..               ...         ...         ...
609             2900   71.000000           Y
610             4106   40.000000           Y
611             8072  253.000000           Y
612             7583  187.000000           Y
613             4583  133.000000           N

[614 rows x 3 columns]

In [809]:
df_train['Loan_Status'].map({'Y':1, 'N':0})

0      1
1      0
2      1
3      1
4      1
      ..
609    1
610    1
611    1
612    1
613    0
Name: Loan_Status, Length: 614, dtype: int64

In [0]:
df_train['Loan_Status'] = df_train['Loan_Status'].map({'Y':1, 'N':0})

In [811]:
df_train

     ApplicantIncome  LoanAmount  Loan_Status
0               5849  146.412162            1
1               4583  128.000000            0
2               3000   66.000000            1
3               2583  120.000000            1
4               6000  141.000000            1
..               ...         ...          ...
609             2900   71.000000            1
610             4106   40.000000            1
611             8072  253.000000            1
612             7583  187.000000            1
613             4583  133.000000            0

[614 rows x 3 columns]

In [812]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 3 columns):
ApplicantIncome    614 non-null int64
LoanAmount         614 non-null float64
Loan_Status        614 non-null int64
dtypes: float64(1), int64(2)
memory usage: 14.5 KB

In [813]:
x = df_train.iloc[:,:-1]
print(x.head(10))
print(type(x))
print(x.shape)

   ApplicantIncome  LoanAmount
0             5849  146.412162
1             4583  128.000000
2             3000   66.000000
3             2583  120.000000
4             6000  141.000000
5             5417  267.000000
6             2333   95.000000
7             3036  158.000000
8             4006  168.000000
9            12841  349.000000
<class 'pandas.core.frame.DataFrame'>
(614, 2)

In [814]:
x = ((x - np.mean(x)) / np.std(x))
x.head()

   ApplicantIncome    LoanAmount
0         0.072991  3.384786e-16
1        -0.134412 -2.192733e-01
2        -0.393747 -9.576410e-01
3        -0.462062 -3.145466e-01
4         0.097728 -6.445428e-02

In [815]:
y = df_train.iloc[:,-1]
print(y.head(10))
print(type(y))
print(y.shape)

0    1
1    0
2    1
3    1
4    1
5    1
6    1
7    0
8    1
9    0
Name: Loan_Status, dtype: int64
<class 'pandas.core.series.Series'>
(614,)

In [816]:
df_test.head(10)

   ApplicantIncome  LoanAmount
0             5720       110.0
1             3076       126.0
2             5000       208.0
3             2340       100.0
4             3276        78.0
5             2165       152.0
6             2226        59.0
7             3881       147.0
8            13633       280.0
9             2400       123.0

In [817]:
x_test = df_test.iloc[:,:]
print(x_test.head(10))
print(type(x_test))
print(x_test.shape)

   ApplicantIncome  LoanAmount
0             5720       110.0
1             3076       126.0
2             5000       208.0
3             2340       100.0
4             3276        78.0
5             2165       152.0
6             2226        59.0
7             3881       147.0
8            13633       280.0
9             2400       123.0
<class 'pandas.core.frame.DataFrame'>
(367, 2)

In [818]:
x_test = ((x_test - np.mean(x_test)) / np.std(x_test))
x_test.head()

   ApplicantIncome  LoanAmount
0         0.186461   -0.429368
1        -0.352692   -0.166482
2         0.039641    1.180807
3        -0.502774   -0.593671
4        -0.311909   -0.955139

In [0]:
from sklearn.linear_model import LogisticRegression
from sklearn import metrics

In [0]:
#from sklearn.neighbors import KNeighborsClassifier
#from sklearn import metrics

In [821]:
#knn = KNeighborsClassifier(n_neighbors = 2) 
#knn.fit(x,y)  
#y_pred = knn.predict(x_test)
#y_pred

array([0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0,
       0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1,
       1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1,
       1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1,
       0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1,
       1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0,
       0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0,
       1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0,
       1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0,
       1, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0,
       0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1,
       1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1,
       1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0,
       0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0])

In [0]:
logreg=LogisticRegression(max_iter=1000)

In [0]:
logreg.fit(x,y)

In [0]:
y_pred = logreg.predict(x_test)
y_pred

In [825]:
predicted = pd.DataFrame({'Loan_Status':y_pred})
predicted

     Loan_Status
0              0
1              1
2              0
3              0
4              0
..           ...
362            1
363            1
364            0
365            0
366            0

[367 rows x 1 columns]

In [826]:
predicted['Loan_Status']= predicted['Loan_Status'].map({1:'Y',0:'N'})
predicted

    Loan_Status
0             N
1             Y
2             N
3             N
4             N
..          ...
362           Y
363           Y
364           N
365           N
366           N

[367 rows x 1 columns]

In [827]:
submit=pd.DataFrame({'Loan_ID':loan_id, 'Loan_Status':predicted['Loan_Status']})
submit

      Loan_ID Loan_Status
0    LP001015           N
1    LP001022           Y
2    LP001031           N
3    LP001035           N
4    LP001051           N
..        ...         ...
362  LP002971           Y
363  LP002975           Y
364  LP002980           N
365  LP002986           N
366  LP002989           N

[367 rows x 2 columns]

In [0]:
submit.to_csv('submission.csv', index=False)

In [0]:
#from google.colab import files
#files.download('submission.csv')